{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.2.2", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "layers": [{"name": "input_2", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_2", "batch_input_shape": [null, 75, 10], "sparse": false, "dtype": "float32"}}, {"name": "time_distributed_1", "class_name": "TimeDistributed", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"name": "time_distributed_1", "trainable": true, "layer": {"class_name": "Embedding", "config": {"output_dim": 30, "embeddings_regularizer": null, "input_length": 10, "dtype": "float32", "input_dim": 86, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "batch_input_shape": [null, 10], "activity_regularizer": null, "trainable": true, "name": "emb_char", "mask_zero": false, "embeddings_constraint": null}}}}, {"name": "time_distributed_2", "class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]], "config": {"name": "time_distributed_2", "trainable": true, "layer": {"class_name": "Conv1D", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1], "bias_regularizer": null, "dilation_rate": [1], "data_format": "channels_last", "use_bias": true, "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "filters": 40, "trainable": true, "kernel_size": [3], "padding": "valid", "name": "Conv1D"}}}}, {"name": "time_distributed_3", "class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_2", 0, 0, {}]]], "config": {"name": "time_distributed_3", "trainable": true, "layer": {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "rate": 0.4, "trainable": true, "seed": null}}}}, {"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_1", "batch_input_shape": [null, 75], "sparse": false, "dtype": "float32"}}, {"name": "time_distributed_4", "class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_3", 0, 0, {}]]], "config": {"name": "time_distributed_4", "trainable": true, "layer": {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_1", "trainable": true}}}}, {"name": "embedding_1", "class_name": "Embedding", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"output_dim": 100, "embeddings_regularizer": null, "input_length": 75, "dtype": "float32", "input_dim": 23625, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "batch_input_shape": [null, 75], "activity_regularizer": null, "trainable": true, "name": "embedding_1", "mask_zero": true, "embeddings_constraint": null}}, {"name": "time_distributed_5", "class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_4", 0, 0, {}]]], "config": {"name": "time_distributed_5", "trainable": true, "layer": {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}}}}, {"name": "concatenate_1", "class_name": "Concatenate", "inbound_nodes": [[["embedding_1", 0, 0, {}], ["time_distributed_5", 0, 0, {}]]], "config": {"name": "concatenate_1", "trainable": true, "axis": -1}}, {"name": "bidirectional_1", "class_name": "Bidirectional", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"name": "bidirectional_1", "merge_mode": "concat", "trainable": true, "layer": {"class_name": "LSTM", "config": {"activity_regularizer": null, "kernel_constraint": null, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "recurrent_dropout": 0.6, "recurrent_regularizer": null, "unroll": false, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activation": "tanh", "return_sequences": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "go_backwards": false, "use_bias": true, "return_state": false, "implementation": 1, "units": 100, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "name": "lstm_1", "recurrent_constraint": null}}}}, {"name": "dropout_2", "class_name": "Dropout", "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "config": {"name": "dropout_2", "noise_shape": null, "rate": 0.5, "trainable": true, "seed": null}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "tanh", "kernel_regularizer": null, "units": 100, "trainable": true, "bias_constraint": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"name": "crf_1", "class_name": "CRF", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "boundary_regularizer": null, "use_boundary": true, "test_mode": "viterbi", "activation": "linear", "boundary_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "unroll": false, "trainable": true, "boundary_constraint": null, "chain_regularizer": null, "chain_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_regularizer": null, "input_dim": 100, "sparse_target": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "chain_constraint": null, "learn_mode": "join", "units": 10, "bias_constraint": null, "name": "crf_1"}}], "output_layers": [["crf_1", 0, 0]]}}